## Staging: network
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 0 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_flow_log.vpc_flow_logs must be replaced
-/+ resource "aws_flow_log" "vpc_flow_logs" {
      ~ arn                      = "arn:aws:ec2:ca-central-1:687401027353:vpc-flow-log/fl-0a1c93a6dc7d6a3a0" -> (known after apply)
      - iam_role_arn             = "arn:aws:iam::687401027353:role/vpc_flow_logs" -> null # forces replacement
      ~ id                       = "fl-0a1c93a6dc7d6a3a0" -> (known after apply)
      ~ log_destination          = "arn:aws:logs:ca-central-1:687401027353:log-group:vpc_flow_logs" -> "arn:aws:s3:::cbs-satellite-687401027353/vpc_flow_logs/" # forces replacement
      ~ log_destination_type     = "cloud-watch-logs" -> "s3" # forces replacement
      ~ log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> "${vpc-id} ${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status} ${subnet-id} ${instance-id}" # forces replacement
      ~ log_group_name           = "vpc_flow_logs" -> (known after apply)
        tags                     = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role.vpc_flow_logs will be destroyed
  - resource "aws_iam_role" "vpc_flow_logs" {
      - arn                   = "arn:aws:iam::687401027353:role/vpc_flow_logs" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "vpc-flow-logs.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-03-31T19:31:29Z" -> null
      - force_detach_policies = false -> null
      - id                    = "vpc_flow_logs" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "vpc_flow_logs" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROA2ADCLI4M32ICI7EXA" -> null

      - inline_policy {
          - name   = "vpc_flow_logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:DescribeLogStreams",
                              - "logs:DescribeLogGroups",
                              - "logs:CreateLogStream",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ca-central-1:687401027353:log-group:vpc_flow_logs:log-stream:*",
                              - "arn:aws:logs:ca-central-1:687401027353:log-group:vpc_flow_logs",
                            ]
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.vpc_flow_logs will be destroyed
  - resource "aws_iam_role_policy" "vpc_flow_logs" {
      - id     = "vpc_flow_logs:vpc_flow_logs" -> null
      - name   = "vpc_flow_logs" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:687401027353:log-group:vpc_flow_logs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:687401027353:log-group:vpc_flow_logs",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "vpc_flow_logs" -> null
    }

Plan: 1 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
